cases/hydrodynamic/translatingDropletInQuiescentFluid3D/templateCase_translatingDropletInQuiescentFluid3D/system/FOsumE
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  com                                   |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      functionObject2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

functions
{
    kinetic_energy
    {
        libs            ("libutilityFunctionObjects.so");
        type            coded;
        name            kinetic_energy;
        writeControl    timeStep;
        writeInterval   1;

        codeWrite
        #{

            const volScalarField& rho =
                mesh().lookupObject<volScalarField>("rho");
            const volVectorField& U =
                mesh().lookupObject<volVectorField>("U");
            const volScalarField& e = magSqr(rho*U);
            Info<< "sum of kinetic_energy = " << gSum(e) << endl;

        #};
    }
}
