cases/hydrodynamic/translatingDropletInQuiescentFluid3D/templateCase_translatingDropletInQuiescentFluid3D/system/setFieldsDict.template
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volVectorFieldValue U (0 0 0)
);

regions
(
    pointToCell
    {
        option any;
        set interfaceRegionCellCorners;

        fieldValues
        (
            volVectorFieldValue U (@!x_velocity!@ @!y_velocity!@ @!z_velocity!@)
        );
    }
);

// ************************************************************************* //
